//
// Created by sasha on 04.03.2023.
//

#include "../include/app.h"
#include "../include/console/console.h"

os_tree_s *global_tree;

bool global_tree_init(int64_t key) {
    global_tree = new_os_tree(key);
}

static void print_greeting() {
    printf("%s\n", "████──████──███──████──███──████──████──████──████───███──████──████──████──████\n"
                   "█──█──█──█───█───█──█───█───█──█──█──█──█──█──█──██──█────█──█──█──█──█──█──█──█\n"
                   "████──█──█───█───████───█───█──█──█─────█──█──█──██──███──████────██────██──████\n"
                   "█─────█──█───█───█──█───█───█──█──█──█──█──█──█──██──█────█─█───██────██────█──█\n"
                   "█─────████───█───█──█───█───████──████──████──████───███──█─█───████──████──████");

    printf("%s\n", "\nДобро пожаловать в консольное приложение.");
}

int app_start(error_s *error) {
    print_greeting();
    console(error);
    return 0;
}